.txta[
  {
    "Name": "Alice",
    "BestArchetypePvE": "TP",
    "BestArchetypePvP": "TP",
    "PvEScore": 8.5,
    "PvPOffenseScore": 9.5,
    "PvPDefScore": 8,
    "Pros": "Very powerful in PVP as her instant-kill skill bypasses Endure-type skills and thus delete key threats.\nGodly Panels, especially Panel 3, giving her more uses of Die for Me! (instant-kill) making her a Top Tier demon.\nHigh damage potential due to good base stats and a powerful base kit (Purple Color gives Dark Amp).\nCan be used in most PVE content like Aura Gate, Brands of Sin (especially Vanity 11) and certain Kiwami.\nMortal ability trivializes many PVE Boss fight by instant-killing the Boss' subordinates (Bosses are immune but their adds are usually not except in Kiwami).",
    "Cons": "Needs Dark Pierce (weak) and Panel 3 to really shine, without those it puts her to around an 8 for PVP Offense and PVE.\nNeeds to run Divines without Panel 2 for first turn Die for Me! and to mitigate long term MP issues.\nSkilled players will play around Alice defense, manipulating her to cast Mamudoon instead of Die for Me! This is because her AI is hard coded to go for what ever will do the most damage over all. To mitigate this, do not put magic attack based brands on her and focus on survivibility and support based stats like HP, Evasion, Defense etc."
  },
  {
    "Name": "Alilat",
    "BestArchetypePvE": "C",
    "BestArchetypePvP": "C",
    "PvEScore": 7,
    "PvPOffenseScore": 6,
    "PvPDefScore": 6,
    "Pros": "While alive, Repel Pierce will prevent pierce skills from going through Repel resistances. This is very useful when combined with demons that have high natural Repels (like Asura Lord or Vairocana) or against popular attack elements like Physical (like Teal Gogmagog and Teal Quetzalcoatl).\nVery high LUK stat allows her to be built as an Ailment inflictor by transfering her an Ailment skill.\nHer innate high LUK, Infernal Mask and Panel 1 provides her with extreme Ailment resistance: transfer her Silent Prayer or Prayer she will be an Ailment cleanser.\nA near Must-Have demon for PVE, particularly Aura Gate 2, as Repel Pierce is perfect for cheesing most Boss fights when you pair it with the appropriate demons.\nGood HP and Vit stats and no weaknesses give her a lot of bulk.\nVery cheap to fuse.",
    "Cons": "Megidola is a wasted skill as her Magic stat is low.\nLack of offensive demons with Repel Phys makes it hard to craft teams around her in PVP."
  },
  {
    "Name": "Amaterasu",
    "BestArchetypePvE": "Y",
    "BestArchetypePvP": "CY",
    "PvEScore": 8,
    "PvPOffenseScore": 4,
    "PvPDefScore": 4,
    "Pros": "One of the best PVE support demons in the game. Tenson Kourin is the best buff spell in the game, guaranteeing you will have all 3 buffs at the end of cast.\nGains access to discounted Mediarahan in Yellow, which heals for a lot thanks to her high magic stat.",
    "Cons": "High MP cost\nElec Weakness\nPanels are very lackluster.\nMaragion is a wasted slot for support builds.\nHealing is less important in PvP, reducing her potential there."
  },
  {
    "Name": "Ananta",
    "BestArchetypePvE": "P",
    "BestArchetypePvP": "P",
    "PvEScore": 5,
    "PvPOffenseScore": 7,
    "PvPDefScore": 7,
    "Pros": "Purple provides all 3 Auto-Buffs, which is incredibly strong\nReasonable bulky with 3 Nulls makes him a decent support demon.\nWorks well in slow double Intimidating Stance Teams, and can be left at level 1 to lower battle speed if used as a pure buff bot.",
    "Cons": "Force weakness and no attack skills\nBuffs disappear after a wave is cleared in PvE, so Auto-Skills arent as valuable there.\nRelies heavily on transfer skills to function well. Unfortunately most good transfer skills are Gacha-only."
  },
  {
    "Name": "Asherah",
    "BestArchetypePvE": "TP",
    "BestArchetypePvP": "TY",
    "PvEScore": 7,
    "PvPOffenseScore": 9,
    "PvPDefScore": 8.5,
    "Pros": "Mother's Creation is the best Resurrection spell in the game, as Press Turn Generation is really strong.\nYellow has Silent Prayer which allows her to be used as an Ailment cleanser.\nVery high VIT and HP stats make her very bulky. She can tank through the deadliest PVP teams and turn the tables with Mother's Creation.\nInnate Mediarama and access to Recovery Amp in purple lets her function as a decent healer in PVE.",
    "Cons": "High MP cost\nTwo weaknesses to common attacking elements.\nLow AGI means she will need Lead Brands or even slower teammates to effectively work as a cleanser.\nResurrection are not very useful in PVE as your demons are not supposed to die. Healing is also subpar in PVE."
  },
  {
    "Name": "Asura",
    "BestArchetypePvE": "TP",
    "BestArchetypePvP": "TP",
    "PvEScore": 9,
    "PvPOffenseScore": 5,
    "PvPDefScore": 5,
    "Pros": "High base STR lets him dish out good damage with Ashura, which is fantastic against lone targets like Bosses and in Democalypse, debuffing them and dealing heavy damage. It can also be used as an AOE as it fully pierces and deals decent splash damage.\nThree Faces Six Arms reduces damage from Random Targetting attacks and redirects them to him. Combined with his good HP and VIT stats, this lets him tank Fire of Sinai and Griffon-Bolts without breaking a sweat.\nMana Aid is fantastic for PVE farming as it lets him spam Ashura between waves.\nSingle-handedly trivializes Brands of Sin Deceit 11.",
    "Cons": "As nothing in his kit provides damage, damage booster transfers are almost mandatory.\nRandom Targetting makes him unusable in PvP. If you Ashura into Masakado, you're going to have a bad time."
  },
  {
    "Name": "Asura Lord",
    "BestArchetypePvE": "TRP",
    "BestArchetypePvP": "TRP",
    "PvEScore": 9,
    "PvPOffenseScore": 8.5,
    "PvPDefScore": 9.5,
    "Pros": "Incredibly high ST Burst damage that also generates press turns thanks to his high Crit Chance.\nSlaughter All is fully unblockable and ignores Endure-type skills, allowing you to delete any demon he claps. It is also very useful to clean up any remaining enemies (usually bosses) after your AOE demons have unleashed their fill, notably BoS: Deceit 11 Metatron.\nPassively increases your team's Crit Rate and Crit Damage through Endless War. Pairs very well with Kartikeya, as their combined passives will give your team a whopping +40% boost to Crit Rate.\nVery good synergy with one of the most threatening PVP defense teams: Hero Masakado T1.\nInsanely high Strength, overall good stats.\nRed gives him a powerful AOE in Gigantomachia. Combined with his innate Great Aim and pierce in Endless War, this makes him a terrifying sweeper.\nGood repel resistances makes him a natural partner for Alilat or Atavaka. Fire and Light repel is especially useful to counter Archangel teams, as it makes him immune to both their AOE elements.",
    "Cons": "Hard to raise Slaughter All's dammage further as it is of the Almighty element (which do not have dedicated boost / amp skills).\nHigh MP cost mandates the use of Divine if not P2, which can slightly reduce his damage potential.\nRisky to use for PVP Random Battle as he is suboptimal in Slow or Midrange teams and may put you in a difficult position in Fast teams whenever he fails to crit."
  },
  {
    "Name": "Atavaka",
    "BestArchetypePvE": "TP",
    "BestArchetypePvP": "P",
    "PvEScore": 7,
    "PvPOffenseScore": 8,
    "PvPDefScore": 8,
    "Pros": "While alive, War Aid will prevent pierce skills from going through Repel resistances. This is very useful when combined with demons that have high natural Repels (like Asura Lord or Vairocana) or against popular attack elements like Physical (like Teal Gogmagog).\nIntimidating Stance is a very powerful passive that synergizes well with his low AGI. He is one of only five demons with this passive, and the only one that can also function as an anti-Pierce demon.\nEnemy Annihilation fully debuffs enemies before chaining into a piercing physical AOE sweep. Because the AOE is a chain effect, you will not lose press turns even if it misses and/or hits into Physical NDR, allowing him to spam it without concern.\nAmazing set of panels that provide him extra damage, MP reduction and a lot of Bulk.\nLike Alilat, his Repel Pierce ability is perfect for cheesing Aura Gate 2 Boss fights.",
    "Cons": "Very high MP costs. Running Divine sets hurt his overall damage and/or Bulk.\nWeak to Ice. While not a common attacking element, it is one of the most exploited - some turn 1 teams have Bufula L teched onto Garuda just to exploit this.\nDoes not have natural Pierce. This can cause issues with his AI attacking into Tetra Shift and/or Physical NDR when out of MP.\nThe fact the debuff from Enemy Annihilation only lasts 1 turn with high MP-cost makes him unsuitable as a debuffer in PVE unless Panel 2."
  },
  {
    "Name": "Baal",
    "BestArchetypePvE": "P",
    "BestArchetypePvP": "CRP",
    "PvEScore": 8,
    "PvPOffenseScore": 8,
    "PvPDefScore": 8,
    "Pros": "Tempest deals high piercing AOE damage and autocasts Sukunda.\nRains of Canaan provides a teamwide Force damage boost.\nGood synergy with other Force sweepers like Susano-o and Garuda A\nRed gives him access to discounted Killing Wind. This gives him a single target attack to use while Force Anti-Pierce is present (such as Rama + Susano-o A). Note that it does not pierce though!",
    "Cons": "Ice weakness\nWithout Panel 2, his PVP and PVE tier rating are lower than 8.\nExpensive to fuse and only available in clear. Colored variants are Gacha exclusive.\nOnly has pierce through Tempest."
  },
  {
    "Name": "Barong",
    "BestArchetypePvE": "TY",
    "BestArchetypePvP": "",
    "PvEScore": 4,
    "PvPOffenseScore": 4.5,
    "PvPDefScore": 4.5,
    "Pros": "Barong Dance heals and buffs in one move.\nVery high AGI allows him to be used as a fast support, especially with Speedster transferred.\nRecarmdra in Yellow gives him access to a Ressurection skill.\nGood Fusion material.\nRed Barong meme pull",
    "Cons": "Red Barong meme pull\nHigh MP costs\n2 weaknesses\nTerrible Magic stats for a healer. Mediocre bulk doesn't help either.\nBarong Dance is limited to only 3 uses and does not heal for much, especially with his low Magic.\nElec attack spells (and Elec Amp in purple) are wasted on his bad Magic stat.\nPanels are rather lackluster\nOutclassed by better support demons like Asherah and Amaterasu."
  },
  {
    "Name": "Bayonetta☆",
    "BestArchetypePvE": "P",
    "BestArchetypePvP": "",
    "PvEScore": 3,
    "PvPOffenseScore": 6,
    "PvPDefScore": 6,
    "Pros": "Madama Stomp levels and Savage Glee in purple give her enormous crit rates.\nMadama Stomp autocasts an Almighty attack that also charms whenever she lands a crit. Deals decent damage after being buffed to scale off her PATK.\nRecent buffs have made her a lot more viable. Panel 2 in particular gives her Pierce which she desperately needs.\nGomorrah (B) has high base damage and crit chance, letting you delete an enemy and charm the rest of the team.",
    "Cons": "Gomorrah (B) takes two turns to charge: impossible to use T1.\nDifficult to build due to Gomorrah (B) scaling off both PATK and MATK.\nMediocre overall stats, bad bulk.\nAbsolutely requires at least P2 to have any relevancy in PVP: get a PVP rating much lower than 6 if not paneled.\nNo longer meme&#160;:("
  },
  {
    "Name": "Black Frost",
    "BestArchetypePvE": "",
    "BestArchetypePvP": "",
    "PvEScore": 7,
    "PvPOffenseScore": 5,
    "PvPDefScore": 5,
    "Pros": "High Magic stat and innate Dark Pierce on Go to Hell! makes him a good magic sweeper.\nAs Curse of Anguish increases his damage against cursed enemies, her partners well with Yama who automatically curses everyone at the start of the Boss wave.\nYellow gains access to Concentrate to further increase his sweeping potential.",
    "Cons": "High MP costs\nLight Weakness\nGo to Hell! has low base power and does not gain damage on level up.\nHis damage output is below average and needs to use his Curse gimmick to have a good damage increase.\nThe Curse gimmick is impractical in PVP.\nDark element AOEs are severely countered by a large part of the Meta (Masakado + Rama or Atavaka + Hecate)"
  },
  {
    "Name": "Black Rider",
    "BestArchetypePvE": "T",
    "BestArchetypePvP": "P",
    "PvEScore": 7,
    "PvPOffenseScore": 6,
    "PvPDefScore": 6,
    "Pros": "Soul Divide punishes healing by dealing Fractional damage based on their current health. Useful in Brands of Sin Vanity stages where healing is abundant.\nFamine deals fractional damage and saps MP at the end of enemies turn.\nBest used to deal with enemies that have auto-healing such as P2 Vishnu.\nDecent Magic stat and good panel bonuses make him a very strong Ice mage if you can panel him.",
    "Cons": "Soul Divide damage is based on Current Health and cannot kill targets.\nHealing is not very common rendering his utility niche at best.\nNeeds Panels (especially P2) to be an effective Mage.\nNot obtainable through the general gem banner or the summon files."
  },
  {
    "Name": "Cu Chulainn",
    "BestArchetypePvE": "P",
    "BestArchetypePvP": "P",
    "PvEScore": 7,
    "PvPOffenseScore": 6,
    "PvPDefScore": 6,
    "Pros": "Best budget pierce sweeper, he can be fused cheaply through 4x4 fusions.\nOne of the best demons to fuse early as he will trivialize a lot of early content.\nNo weaknesses reduce reliance on transfer skills.\nPanels help him maintain relevance late game and are reasonable to strive toward due to how cheap his fusions are.\nWhile not common, he can be run as a physical nuker to some degree. He has innate Savage Glee and Gae Bolg hits hard against bosses (especially after Panels).\nLow AGI makes him useable in Intimidating Stance teams.",
    "Cons": "High MP costs, cannot sweep Turn 1 in PVP unless P3.\nMediocre Magic stat\nNo ST attacks means he will have trouble against Anti-Pierce. Fortunately, Force Anti-Pierce isn't too common.\nRelies on transfer skills to increase his damage.\nLow AGI and LUK hinders his Phys potential."
  },
  {
    "Name": "Cu Chulainn A",
    "BestArchetypePvE": "R",
    "BestArchetypePvP": "TP",
    "PvEScore": 8,
    "PvPOffenseScore": 8.5,
    "PvPDefScore": 8.5,
    "Pros": "Has full pierce on two elements.\nBarbed Spear deals three separate hits, allowing it to function as an Endure breaker. He is a good candidate for Hero Masakado T1\nAuto-Charge at end of turn allows him to deal massive damage if he is not taken out.\nTeal has Drain Phys to pair with Rama in Drain Teams, increasing his survivability.",
    "Cons": "Needs to survive an entire round to make use of the Auto-Charge effect.\nMissing just one of Barbed Spear's 12 hits will result in lost press turns.\nRequires damage booster transfers as nothing in his kit provides it."
  },
  {
    "Name": "Cybele",
    "BestArchetypePvE": "C",
    "BestArchetypePvP": "C",
    "PvEScore": 7,
    "PvPOffenseScore": 4.5,
    "PvPDefScore": 4.5,
    "Pros": "High Magic stat. Magna Mater and innate Trisagion + Maragidyne make her an extremely good Fire caster.\nExcellent Panel 1.\nMagna Mater provides a team-wide Fire damage boost, incredible for Democalypse.\nInnate Merciless Blow further increases her Democalypse potential.",
    "Cons": "Heavy fire specialisation + lack of Fire Pierce means she will struggle against Fire NDR.\nIn PVP, Fire Pierce (weak) is insufficient due to the popularity of Asherah and Rama\nExpensive multi-fusion that requires clear Asherah."
  },
  {
    "Name": "Daisoujou",
    "BestArchetypePvE": "",
    "BestArchetypePvP": "P",
    "PvEScore": 8,
    "PvPOffenseScore": 9,
    "PvPDefScore": 8,
    "Pros": "Preach makes him immune to all ailments and will punish enemy teams attempting to use Charm. Cleansing Shout is an Ailment and Debuff Cleanse packed into one skill. These two skills function together to make him the best Anti-Ailment demon in the game.\nGood balanced stats coupled with no weaknesses and a perfect base kit allows total freedom in builds.\nCan work as a bulky tank, evasion tank, healer and/or revive support based on build.\nVery useful for Brands of Sin Sloth 11 auto-runs.",
    "Cons": "Gacha Exclusive\nIs a hard support unit, relies on transfer skills to offer anything outside cleanse"
  },
  {
    "Name": "Dante☆",
    "BestArchetypePvE": "",
    "BestArchetypePvP": "RP",
    "PvEScore": 7,
    "PvPOffenseScore": 5,
    "PvPDefScore": 5,
    "Pros": "High Str plus Auto-Rebellion from Rapid Shot makes him a good Phys Sweeper.\nVery bulky with no weaknesses.\nMillion Stab is a multihit AOE skill, breaking Endures and piercing while in Might.\nPairs well with Hell Biker for free Rebellion setup.\nMeme",
    "Cons": "Low AGI and LUK affects his accuracy.\nWill not autocast Rebellion if any of his Rapid Shot misses.\nMediocre Awakening skills."
  },
  {
    "Name": "Fafnir",
    "BestArchetypePvE": "T",
    "BestArchetypePvP": "TP",
    "PvEScore": 3,
    "PvPOffenseScore": 5,
    "PvPDefScore": 5,
    "Pros": "Innate Drain Phys makes him usable in Drain Teams.\nHigh STR. Dragon Sense provides him additional accuracy and evasion.\nGolden Greed increases poison damage ticks, dealing consistent damage each turn.",
    "Cons": "Ailments generally fall flat in late/endgame PvE because of inflated enemy stats.\nHard countered by Ailment Cleansers like Daisoujou or Kinmamon in PVP.\n2 Weaknesses.\nBlight has low base damage.\nIs outclassed pretty much in every way by Pale Rider as a Poison caster."
  },
  {
    "Name": "Frost Ace",
    "BestArchetypePvE": "P",
    "BestArchetypePvP": "RP",
    "PvEScore": 7,
    "PvPOffenseScore": 6,
    "PvPDefScore": 6,
    "Pros": "Very good Ice Nuker with built-in Ice Boost and Master Assassin in purple.\nGood Ice sweeper with Mabufula in red\nVengeful Frost Fist is a heavy hitting Ice-element Physical attack that can Crit and autocasts Rebellion on hit. This allows him to crit infinitely at the cost of a measly 4 MP.\nIcy Rage provides a teamwide Ice damage buff, incredible for Democalypse.",
    "Cons": "No added accuracy in his kit. Requires Accuracy investment as Vengeful Frost Fist is prone to missing.\nVengeful Frost Fist cannot hit through Tetrakarn nor any Ice NDR without P3 or Ice Pierce (weak).\nNon-fusable and not obtainable through the general gem banner or the summon files."
  },
  {
    "Name": "Gabriel",
    "BestArchetypePvE": "TR",
    "BestArchetypePvP": "TR",
    "PvEScore": 8,
    "PvPOffenseScore": 8,
    "PvPDefScore": 8,
    "Pros": "When combined with two other Herald or Divine demons, God's Word dishes out massive damage even before battle really begins.\nChain effects do not consume press turns even when hitting NDR.\nInnate Pierce with decent Magic + Revive makes for a good unique Skill.\nPart of a very strong PVP strategy: Archangels\nGood for PVE content like Brands of Sin Sloth, the general story and Aura Gate (note that her passive will kill demons before they have a chance to talk)",
    "Cons": "Needs a specific team built fully around her\nReflected God's Word will damage her, as the skill inherently carries pierce. Beware of counter Alilat and Atavaka strats.\nThe current metagame is filled with teams tanky enough to survive any Archangels teams.\nNon-fusable and not obtainable through the general gem banner or the summon files."
  },
  {
    "Name": "Garuda A",
    "BestArchetypePvE": "TYP",
    "BestArchetypePvP": "YRP",
    "PvEScore": 6,
    "PvPOffenseScore": 7,
    "PvPDefScore": 7,
    "Pros": "Good Magic and Agi Stats\nInnate Force pierce in Brilliant Wings and discount Mazandyne in Red.\nBrilliant Wings fits well in an evasion based team together with Nekomata A.\nGale Talon is very damaging against lone targets like Bosses, making him very potent for Democalypse.",
    "Cons": "Needs a team built around him to be really effective\nUseless against Magic teams\nGale Talon takes time to reach full potential, reducing his T1 potential."
  },
  {
    "Name": "Garuda",
    "BestArchetypePvE": "",
    "BestArchetypePvP": "YRP",
    "PvEScore": 9,
    "PvPOffenseScore": 8,
    "PvPDefScore": 8,
    "Pros": "One of the fastest and most flexible demons in the game. Good set of resistances plus battlespeed makes him useful for most PVE content including Aura Gate and Brands of Sin Vanity 11.\nAuto-Rakunda increases your team's damage output, synergizes well with his Turn 1 focus.\nVahana provides additional Evasion and Ailment Resistance, allowing him to function as a dodge tank or even a cleric with Prayer.\nRed gives him access to discounted Maragidyne, giving him a cheap T1 nuke. Yellow makes him more support-oriented with Fog Breath, Purple gives him extra damage range for easier Zandyne assassinations with Berserker.\nEasy 4x4 fusion paths and good panels make him a good first fusion and decent P3 goal to strive toward.",
    "Cons": "Does not have Speedster innately, requires a transfer which in turn reduces his skill slots.\nIce weakness\nOne of the lowest bulk in the game."
  },
  {
    "Name": "Gogmagog",
    "BestArchetypePvE": "TR",
    "BestArchetypePvP": "CTR",
    "PvEScore": 6,
    "PvPOffenseScore": 7,
    "PvPDefScore": 6,
    "Pros": "Very high bulk for PVE tanking. Innate Earthquake lets him hit hard off that bulk.\nThree weaknesses makes him a good partner for Orcus.\nLess competition for Brands compared to your other demons, as he relies on PDEF to deal damage.\nOnly transferrable source of Earthquake.\nPanels let him play a more support-oriented role, providing team-wide bonuses as long as he is alive. Crit resistance is especially valuable in the current PVP meta, which has heavy crit emphasis.\nRepel Phys in Teal pairs well with Alilat or Atavaka as an Anti-Pierce unit.",
    "Cons": "Abysmal AGI means he misses. A lot.\nAdded damage from Weakness adds up really fast, even with his heal.\nHeal on weakness gimmick is heavily punished by Black Rider.\nNo innate pierce and is a bad choice for Hell Gongen due to his terrible AGI.\nDoes not provide much compared to other more standard physical sweepers like Shiva."
  },
  {
    "Name": "Guan Yu",
    "BestArchetypePvE": "TR",
    "BestArchetypePvP": "TP",
    "PvEScore": 8,
    "PvPOffenseScore": 9,
    "PvPDefScore": 9,
    "Pros": "No weaknesses and high VIT stats make him very tanky, especially with Life Brands.\nHigh STR and native Phys Pierce make him a physical powerhouse.\nLoyal God of War refunds MP and heals him on a kill, giving him insane amounts of self-sustain.\nInnate Savage Glee lets him Crit and generate Press Turns effectively, especially if given Epitome of Carnage or paired with Crit boosters like Asura Lord or Kartikeya.\nNull Mortal in Purple, Drain Phys for pairing with Rama in Teal, Red for pure PvE.",
    "Cons": "Low Agi stat means he will have accuracy issues. Dragon Blade's chain effect will not activate if it misses on the first target.\nHighly dependant on the first kill for tempo. Failing to secure the first kill will result in him not having enough MP for the next turn.\nOnly has ST skills unless in Red, which reduces his overall PvP usefulness"
  },
  {
    "Name": "Hecate",
    "BestArchetypePvE": "TP",
    "BestArchetypePvP": "TP",
    "PvEScore": 8,
    "PvPOffenseScore": 8,
    "PvPDefScore": 8,
    "Pros": "Hell's Trivia is a cheap, hard-hitting spell that also functions as an Endure breaker. Coupled with her respectable Mag stat and Dark Enhancement in purple, she can be built as a powerful dark mage.\nVirtually immune to ailments thanks to Null Bind and Lunar Awakening. Transferring a cleanse skill like Prayer or Silent Prayer will allow her to function as a cleric, while still maintaining her offensive presence.\nInnate Repel Dark means she can't be sniped by Alice if paired with an anti-pierce unit like Alilat or Atavaka. This is very significant as most dedicated ailment teams run Alice to remove the cleric.\nAmazing set of panels that provide her extra bulk, MP recovery and damage. Panel 2 in particular lets her run Life or Spell brands while not worrying about MP.",
    "Cons": "Not very bulky. Coupled with her Light weakness, this makes her very weak to the Archangel matchup.\nLunar Awakening only triggers at the end of the enemy's turn. This makes her useless for Brands of Sin Sloth 11, as the ailments trigger at the beginning of the turn."
  },
  {
    "Name": "Hresvelgr",
    "BestArchetypePvE": "RP",
    "BestArchetypePvP": "YRP",
    "PvEScore": 7,
    "PvPOffenseScore": 8,
    "PvPDefScore": 8,
    "Pros": "Highest Base AGI in the game. He even gets a 20% Bonus to Battle Speed on Panel 3, making him invaluable for fast teams.\nHis unique North Wind deals AOE Ice damage whenever an opposing demon dies. This adds to the damage of fast T1 teams and allows him to clear Endures.\nAuto-Rakunda in Purple further increases his T1 kill potential.\nDecent MAG with innate Ice Boost lets him fire off strong Budufynes.",
    "Cons": "No ice pierce.\nNo innate Speedster.\n2 weaknesses. Phys weakness is particularly bad."
  },
  {
    "Name": "Huang Di",
    "BestArchetypePvE": "R",
    "BestArchetypePvP": "RP",
    "PvEScore": 9,
    "PvPOffenseScore": 6,
    "PvPDefScore": 6,
    "Pros": "Superior Power gives him Phys Pierce and an accuracy boost.\nYinglong Killer hits incredibly hard and has a high crit rate, demolishing teams without anti-Pierce.\nNo weaknesses",
    "Cons": "Needs to rely on transfer skills to increase his damage\nLack of ST skills unless Red\nHigh MP costs\nAI is very unreliable for defense; will occasionally Yinglong Killer into Anti-Pierce and lose press turns.\nNo longer the absolute nightmare he was on release, needs Panels to keep up with newer demons."
  },
  {
    "Name": "Huang Long",
    "BestArchetypePvE": "YP",
    "BestArchetypePvP": "YP",
    "PvEScore": 8,
    "PvPOffenseScore": 5,
    "PvPDefScore": 5,
    "Pros": "High AGI means that combined with Speedster he can greatly boost your battle speed.\nCombined with his decent MAG: makes him a suitable candidate for a fast mage pvp team.\nFive Elements walls magical demons without Pierce, such as Mother Harlot, Masakado A and non-purple Rama.\nLuster Candy in Yellow gives him even more support utility in buff control.\nTrivializes Brands of Sin stage 10, opening up brand farming on Auto.",
    "Cons": "Pierce destroys him through Five Elements.\nFive Elements can be removed through Makara Break especially P3 Samael.\nYellow AI has issues on auto as it will sometimes cast Luster Candy when you want to be spamming Five Elements instead.\nVery MP hungry, needs Divine Brands or Mana Aid to function well.\nPanels are lackluster."
  },
  {
    "Name": "Indrajit",
    "BestArchetypePvE": "TP",
    "BestArchetypePvP": "P",
    "PvEScore": 9,
    "PvPOffenseScore": 9,
    "PvPDefScore": 8,
    "Pros": "High Magic and good Agi Stats\nHigh Burst Damage in Lightning Shower, which refunds MP on kill allowing him to loop it again.\nCasts Five Elements on kill, which completely walls off Almighty attackers like Mother Harlot.\nMaxed Lightning Shower lets him use Spell Brands and still cast it Turn 1 in PvP",
    "Cons": "Highly dependant on the first kill for tempo. Failing to kill will result in MP Problems.\nIce Weakness (Sort of mitigated by Five Elements on kill, but beware pierce users as well as being outsped)"
  },
  {
    "Name": "Ishtar",
    "BestArchetypePvE": "TYR",
    "BestArchetypePvP": "TY",
    "PvEScore": 6,
    "PvPOffenseScore": 4,
    "PvPDefScore": 4,
    "Pros": "Extremely high magic, combined with her Panels make her one of the strongest magic sweepers in the game.\nHer unique spell Mesopotamian Star deals Almighty damage while autocasting Tarukaja and Tarunda. At Panel 3, this further applies Rakukaja and Sukukaja.\nGains Concentrate in Yellow, letting her nuke even harder.\nEasy 4x4 fusion paths and good panels make her a decent P3 goal to strive toward.",
    "Cons": "Very high MP costs\nMesopotamian Star has low base power.\n2 weaknesses\nLow AGI stat and bad bulk."
  },
  {
    "Name": "Ixtab",
    "BestArchetypePvE": "",
    "BestArchetypePvP": "YRP",
    "PvEScore": 6,
    "PvPOffenseScore": 8,
    "PvPDefScore": 6,
    "Pros": "Yaxche autocasts an almighty Mortal spell that will instakill the enemy that killed her, ignoring Endure.\nYou can deliberately leave her at Lv 1 to bait the AI into killing her and committing suicide. Use teammates with Revive to repeat this cycle.\nWorks well with Intimidating Stance strats as leaving her at Lv 1 will severely reduce Battle Speed.\nYellow gives her a good Ailment skill to spam.\nRed provides her with a good ST Skill. With a Master Assassin transfer and Zanma L, she can effectively hit lots of uncovered weaknesses in PVP, one hitting squishies, and guaranteed 3 hit KO tanks making her go 3 for 1 if ignored.",
    "Cons": "Five Elements and Null Mortal blocks Yaxche, completely shutting her down.\nLv 1 strats offers nothing for PVE; also most important targets in PvE are immune to Mortal (Bosses and Kiwami Adds for example)"
  },
  {
    "Name": "Izanami",
    "BestArchetypePvE": "YRP",
    "BestArchetypePvP": "P",
    "PvEScore": 7,
    "PvPOffenseScore": 7,
    "PvPDefScore": 7,
    "Pros": "Very high Magic stat. When paired with innate Merciless Blow, her unique Yomotsu Okami and Elec Amp in purple, she will decimate anything weak to Elec, making her perfect for Democalypse.\nYomotsu Okami provides a teamwide increase to Dark and Elec damage, further increasing her Democalypse potential.\nGreat set of panels that provide her MP reduction, Elec Pierce and increased damage.\nPairing her with Eileen can help to maximize Bolt Storm's potential.",
    "Cons": "Very expensive to fuse\nHas no true ST or AOE spells.\nVery RNG reliant in Democalypse as you cannot rely on Eileen to weather out bad Bolt Storm rolls."
  },
  {
    "Name": "Jeanne☆",
    "BestArchetypePvE": "P",
    "BestArchetypePvP": "P",
    "PvEScore": 4,
    "PvPOffenseScore": 4,
    "PvPDefScore": 4,
    "Pros": "Madama Uppercut autocasts a follow-up Almighty attack upon Charm that also inflicts Bind.\nEvade and Madama Uppercut levels increase her evasion and allow her to function as a dodge tank.\nGomorrah (J) has high base damage and crit chance, with a high chance to Bind all enemies.\nPairs well with Bayonetta or any other sources of charm like Lakshmi.",
    "Cons": "Gomorrah (J) takes two turns to charge, making T1 shenanigans impossible.\nAwkward combination of balanced stats and having both Physical and Magic skills make her pretty mediocre at everything.\nVery bad bulk means she will get shredded by Magic teams, which ignore her evasion.\nPretty much outclassed by P3 Lilith, who does Bind upon Charm better.\nPanels do not benefit her much."
  },
  {
    "Name": "Kartikeya",
    "BestArchetypePvE": "C",
    "BestArchetypePvP": "C",
    "PvEScore": 9,
    "PvPOffenseScore": 8.5,
    "PvPDefScore": 8,
    "Pros": "Fastest demon in the game especially when passive is maxed, allowing you to hit battlespeed requirements in PVE easily.\nSkanda proides teamwide Accuracy and Crit chance boost.\nMortal Jihad plus Great Aim means he will rarely miss, while having a good crit rate to generate press turns for your team.\nNo weaknesses and innate Speedster gives him great flexibility over transfer slots and lets him fulfill a variety of roles.\nImportant demon in the Hero Masakado T1 strategy, one of the strongest strategy.",
    "Cons": "No innate pierce means he will have trouble with Tetra Shift, unless you inherit Phys Pierce (weak).\nVery expensive to fuse and panel."
  },
  {
    "Name": "Lakshmi",
    "BestArchetypePvE": "",
    "BestArchetypePvP": "TP",
    "PvEScore": 6,
    "PvPOffenseScore": 5,
    "PvPDefScore": 5,
    "Pros": "Extremely high Magic and Luck stats allow her to be built as either a Sweeper or an Ailment inflictor.\nHer High Luck, Insanity combined with Lotus Dance's high Charm rate virtually guarantees she will Charm everything that does not Null it.\nP3 allows her to generate MP for the team, enabling certain first-turn kill strats like Shiva A.",
    "Cons": "Force weakness\nLack of good innate offensive skills wastes her sweeper potential.\nCountered very hard by Daisoujou clearing her charms and punishing her for using them.\nVery bad bulk"
  },
  {
    "Name": "Lilith",
    "BestArchetypePvE": "",
    "BestArchetypePvP": "C",
    "PvEScore": 7,
    "PvPOffenseScore": 6,
    "PvPDefScore": 6.5,
    "Pros": "Two strong Dark and Elec AOE skills.\nDecent Magic allows her to deal damage while also inflicting ailments on the enemy.\nP3 casts a teamwide Bind whenever an enemy is charmed, and can be triggered multiple times per turn.\nEasy 4x4 fusion paths and good panels make her a decent P3 goal to strive toward.",
    "Cons": "No pierce, requires Dark Pierce (weak) to really shine.\nCountered very hard by Daisoujou clearing her charms and punishing her for using them.\n2 weaknesses\nUnderwhelming without P3. She is below 6 in PVP without P3."
  },
  {
    "Name": "Lucifer",
    "BestArchetypePvE": "P",
    "BestArchetypePvP": "P",
    "PvEScore": 7,
    "PvPOffenseScore": 6.5,
    "PvPDefScore": 6.5,
    "Pros": "Morning Star is the most powerful Almighty AOE spell in the game.\nAdd to it Purple and Panels to make it the most powerful AOE spell.\nGood bulk especially with Panel 2 unlocked. This helps him live long enough to build up the MP necessary for Morning Star.\nMakes him a strong Intimidating Stance Teams candidate.\nPaired with Panel 1 Lucifuge, you can also use him in a devastating Turn 1 Sweeper team.\nRepel Dark is sometimes useful with Alilat or Atavaka against bosses with Dark Pierce.",
    "Cons": "Light weakness\nVery, VERY expensive to fuse and panel.\nHigh MP costs means he quickly loses his value in long battles. He requires brands good enough to allow him to end the battle quickly, else he is just a subpar damage dealer.\nRequires Panel 3 to compensate for low MAG and the fact Almighty cannot be boosted by a dedicated passive skill.\nMegidolaon and Trisagion aren't very useful.\nFull Almighty / non-Piercing kit means he is shut down hard by Five Elements."
  },
  {
    "Name": "Lucifuge",
    "BestArchetypePvE": "C",
    "BestArchetypePvP": "C",
    "PvEScore": 7,
    "PvPOffenseScore": 6.5,
    "PvPDefScore": 6.5,
    "Pros": "Hell's Ministry reduces Almighty cost for all Tyrant race demons and improves their bulk. Paired with his Panel 1 Bonus, this will give a whopping 2MP discount and enable powerful Turn 1 combos such as Lucifer's Morning Star.\nLight Devourer is a hard-hitting single target Dark spell, further amplified by innate Dark Amp.\nClear gains access to discounted Necro Dogma. As it only costs 6MP when maxed (5MP if Panel 1), it can be fired off Turn 1 and giving your whole party a defensive buff as a bonus.",
    "Cons": "Extremely expensive to fuse: You are looking at nearly 10 million Magnetite from scratch.\nRequires Panel 1 to really shine.\nUnimpressive without good teammates. His best partner Lucifer is another very expensive fusion, and requires Panel 3 to be really competitive in PVP.\nMiddling AGI hurts battle speed for fast T1 teams.\nLight weakness"
  },
  {
    "Name": "Mahakala",
    "BestArchetypePvE": "RP",
    "BestArchetypePvP": "RP",
    "PvEScore": 9,
    "PvPOffenseScore": 8,
    "PvPDefScore": 7,
    "Pros": "High Magic stats and innate Concentrate + Pierce from The Great Darkness make him a very powerful ST Nuker.\nWrathful Flame reduces defense, allowing your teammates to hit harder. It can also be cast on turn 1 PVP with spell brands if maxed.\nVery effective in Democalypse boss rounds as buffs/debuffs are difficult to come by.\nGoes through Endure as Wrathful Flame counts as three separate hits.",
    "Cons": "Lack of MP recovery means he cannot effectively spam Wrathful Flame in PVP.\nCombination of ST and AOE in his kit, coupled with innate Fire Amp makes it difficult to further boost damage.\nIf Mahakala is not alive at the beginning of the turn The Great Darkness won't increase the turn count until Mahakala is revived and survives until the start of the following turn."
  },
  {
    "Name": "Mara",
    "BestArchetypePvE": "P",
    "BestArchetypePvP": "P",
    "PvEScore": 7,
    "PvPOffenseScore": 4,
    "PvPDefScore": 4,
    "Pros": "Only fuseable source of Phys Pierce.\nHigh STR and LUK means he will hit hard and crit often.\nHell Thrust is very strong against bosses and in Democalypse, especially if he is P3.\nMeme",
    "Cons": "Ice Weakness and non-existent bulk makes him go limp at the sight of Ice skills.\nHigh MP costs give Mara a big refractory period.\nExpensive to fuse, will quickly blow through your Magnetite reserves.\nRequires damage boost transfer to supplement his damage.\nMiddling AGI means he will have accuracy issues and occasionally miss the hole. Also doesn't slot into Intimidating Stance teams well as a result.\nDue to mara having no single target besides his thrust attack, Anti-Pierce units like Rama, Alilat and Atavaka are a turn off."
  },
  {
    "Name": "Masakado A",
    "BestArchetypePvE": "",
    "BestArchetypePvP": "P",
    "PvEScore": 9,
    "PvPOffenseScore": 9,
    "PvPDefScore": 9.5,
    "Pros": "Guardian of the East provides 1 extra Press Turn when going first. Press Turn generation is in general very strong.\nKuyo Flash can be cast 1st turn and swings offensive buffs entirely in your favor through autocast Tarukaja, Rakunda, Sukukaja and Sukunda.\nIncredible set of resistances with 3 Nulls (Phys, Dark, Light) and no weakness allows you to tailor the rest of his transfer slots however you please.",
    "Cons": "No good physical attacks to exploit his innate Phys Pierce. Only phys attack available to him is Myriad Arrows in Red which has random targeting and not very reliable.\nKuyo Flash does not deal a lot of damage due to low base power.\nEasily countered by outspeeding.\nUnable to be paired with Masakado"
  },
  {
    "Name": "Masakado",
    "BestArchetypePvE": "P",
    "BestArchetypePvP": "TP",
    "PvEScore": 9,
    "PvPOffenseScore": 10,
    "PvPDefScore": 10,
    "Pros": "Has THE highest Strength stat and the second/third highest Luck stat in-game.\nPowerful and loaded passive in Warlord's Wrath.\nA really strong ST Phys skill which can also inflict Mortal in Occult Flash.\nHas no weakness and a perfect base kit, allowing you to tailor his remaining transfer slots however you like.\nTeal paired with Rama allows him to act as an Anti-Pierce unit.",
    "Cons": "Low agility and high MP cost skills reduces his PVE viability, especially for battles over waves. This requires him to inherit certain skills or be paired with certain teammates to be fully effective in PVE.\nDoesn't have the best Vitality stat.\nUnable to be paired with Masakado A."
  },
  {
    "Name": "Mastema",
    "BestArchetypePvE": "P",
    "BestArchetypePvP": "P",
    "PvEScore": 7,
    "PvPOffenseScore": 7,
    "PvPDefScore": 7,
    "Pros": "Good Magic coupled with Trial of Hate's high base power makes him an incredible Light sweeper. The debuff is just icing on the cake.\nMaxed Trial of Hate can be used Turn 1 with Divines.\nGood set of resistances with 1 Null and 2 Reflects.\nEasy 4x4 fusion paths and good panels make him a decent P3 goal to strive toward.\nLaughs at his enemies occasionally",
    "Cons": "No innate pierce, requires Light Pierce (weak) to really shine.\nFire weakness\nBinding Cry, while a flavorful skill is unfortunately wasted on Mastema."
  },
  {
    "Name": "Metatron",
    "BestArchetypePvE": "CYR",
    "BestArchetypePvP": "C",
    "PvEScore": 8,
    "PvPOffenseScore": 6.5,
    "PvPDefScore": 6.5,
    "Pros": "Good HP and Vit stats paired with great resistances gives him decent of bulk, especially with innate Enduring Soul in Clear.\nHigh Magic stat and Infinite Chakra lets him function well as a magic sweeper.\nPairs well with Uriel and Gabriel, as Fire of Sinai is great for cleaning up and breaking Endures.\nGains discounted Mahamadyne in Red which is great for Brands of Sin Sloth 10 and 11 farming.\nP3 amplifies all Magic damage.",
    "Cons": "Very difficult to fuse, only 1 recipe available.\nFull Almighty / non-Piercing kit means he is shut down hard by Five Elements.\nLow luck stat."
  },
  {
    "Name": "Michael",
    "BestArchetypePvE": "TY",
    "BestArchetypePvP": "T",
    "PvEScore": 7,
    "PvPOffenseScore": 3,
    "PvPDefScore": 3,
    "Pros": "Soul Judgement deals massive damage against single targets, ideal for Bosses and Democalypse.\nMegidolaon gives him an Almighty AOE spell.\nPanels give him a lot of damage, especially P3.\nYellow gives him access to discounted Mediarahan, allowing him to double as a healer.\nVery good set of resistances, especially in Teal.",
    "Cons": "No innate Pierce and mediocre Stats\nHigh STR stat is wasted on a Mage.\nNeeds good transfers and/or panels to boost Damage"
  },
  {
    "Name": "Mot",
    "BestArchetypePvE": "",
    "BestArchetypePvP": "YRP",
    "PvEScore": 7,
    "PvPOffenseScore": 7,
    "PvPDefScore": 6,
    "Pros": "His high bulk pairs well with Harmonious Death which is strong in extended fights.\nHarmonious Death makes Mot a must-have in Prelim Parties for Democalypse.\nHas two strong AOE spells.\nAmazing set of panels that provide him MP reduction, Null Mortal and even more Press Turns.",
    "Cons": "Elec weakness\nHigh MP costs"
  },
  {
    "Name": "Mother Harlot",
    "BestArchetypePvE": "",
    "BestArchetypePvP": "T",
    "PvEScore": 6,
    "PvPOffenseScore": 8,
    "PvPDefScore": 8,
    "Pros": "Babylon Goblet drains MP from all enemies while providing her MP sustain, allowing her to loop the same attack over and over even without Divine Brands.\nTeal gives her Drain Phys, ideal for pairing with Rama. Notably, she is the only Drain Phys unit that can function as a magic sweeper.\nHas access to discounted Debilitate in Yellow, letting her play a more support role if needed.\nWorks very well with slow Ailment teams. When paired with a P3 Samael or her own P1, Death Lust lets her charm without consuming press turns, and increases her damage dealt.",
    "Cons": "Force weakness\nFull Almighty kit means she is shut down hard by Five Elements\nLow AGI and high MP costs makes her unsuitable for fast teams.\nCountered very hard by Daisoujou clearing her charms and punishing her for using them.\nThe MP drain aspect of Babylon Goblet is less useful for PVE, as the AI has infinite MP. It does allow you to replenish her MP indefinitely though."
  },
  {
    "Name": "Nergal",
    "BestArchetypePvE": "RP",
    "BestArchetypePvP": "P",
    "PvEScore": 6,
    "PvPOffenseScore": 5,
    "PvPDefScore": 5,
    "Pros": "Plague of Babylon removes Barriers and has a very high chance of landing Weak status, making him incredible setup for Ailment teams.\nHigh STR, Auto-Tarukaja and increased Accuracy from Meslamtaea make him a decent Physical demon, especially when Paneled.\nAuto-Rebellion on Poison further boosts his damage and synergizes well with Pale Rider.\nIs a very strong set up based sweeper",
    "Cons": "Ailments generally fall flat in late/endgame PvE because of inflated enemy stats\nHard countered by Ailment Cleansers like Daisoujou or Kinmamon in PVP.\nP3 Samael offers similar barrier break without consuming a Press Turn. This is vital versus double Intimidating Stance teams, as it allows you to Barrier Break, kill/disable their cleanser and still have an extra press turn for Ailments.\nSet up based sweeping takes too long and is out classed by basically any non-setup based sweeper such as Masakado or Shiva A."
  },
  {
    "Name": "Nero☆",
    "BestArchetypePvE": "",
    "BestArchetypePvP": "RP",
    "PvEScore": 8,
    "PvPOffenseScore": 6,
    "PvPDefScore": 6,
    "Pros": "Overture deals Piercing damage while giving him free Concentrate, letting him sweep hard.\nVoltage synergises perfectly with Overture and gives your party attack and accuracy/evasions buffs.\nVery good for Democalypse where he does not have to worry about MP issues and can repeatedly spam Concentrated Overtures while on Spell Brands for insane damage.",
    "Cons": "Hard countered by Anti-Pierce, as Overture will not autocast Concentrate (and by extension Voltage) if the attack hits into NDR.\nMediocre stats, relies on Concentrate from Overture to deal damage.\nNo ST skills if not in Red.\nHigh MP costs and no MP recovery prevent him from spamming his spells freely.\nLimited-time Collaboration unit, unlikely to return in the future.\nAs such, he has no Panels, meaning he is missing a lot of potential power."
  },
  {
    "Name": "Orcus",
    "BestArchetypePvE": "TY",
    "BestArchetypePvP": "TY",
    "PvEScore": 7,
    "PvPOffenseScore": 8,
    "PvPDefScore": 8,
    "Pros": "Very good bulk and survivability thanks to Hell's Gate providing AOE reduction.\nLaw of Hell and Hell's Gate pair well with demons with multiple weakness like Asherah and Hecatoncheires. Not only does it save them a transfer slot for covering weakness, it also provides the team additional AOE reduction.\nVery good buff control with innate War Cry and Nocturne in Yellow.\nLaw of Hell eliminates his need to cover weaknesses. This allows him to further support the team through transfers like Samarecarm, Recarmdra, Auto-Tarunda etc.",
    "Cons": "You will still receive extra damage from open weaknesses.\nLaw of Hell only works on AOE damage. Single target skills will still hurt especially if they hit weakness.\nVery MP Hungry, Divines help with the MP costs but in turn reduce his bulk.\nNeeds specific team compositions to work well."
  },
  {
    "Name": "Pale Rider",
    "BestArchetypePvE": "TP",
    "BestArchetypePvP": "TY",
    "PvEScore": 5,
    "PvPOffenseScore": 8,
    "PvPDefScore": 8,
    "Pros": "Very good in Ailment Team, as Pestilence will kill any enemy after 2 turns! This is very important as Ailment Teams struggle to build demons combining high damage, ailment rates and speed (they want to go first).\nGood synergy with a set-up based sweeper Nergal. Nergal helps to remove any barriers and poison in turn triggers his own Meslamtaea passive.\nVery effective as a random PVP defense to catch teams without ailment cleanse.\nGains the strongest debuff Debilitate in Yellow, letting him double as a debuffer.",
    "Cons": "Ailments generally fall flat in late/endgame PvE because of inflated enemy stats\nHard countered by Ailment Cleansers like Daisoujou or Kinmamon in PVP.\nPestilence only kicks in at the end of enemy's turn, giving them one whole turn to cleanse it away or just outright kill him.\nRequires a specific team built around him to really work.\nP1 and P2 don't contribute to the Ailment build.\nNot obtainable through the general gem banner or the summon files."
  },
  {
    "Name": "Quetzalcoatl",
    "BestArchetypePvE": "",
    "BestArchetypePvP": "TP",
    "PvEScore": 7,
    "PvPOffenseScore": 6,
    "PvPDefScore": 6,
    "Pros": "Usually run as a support demon. Ce Acatls' Return is an incredible ressurection spell that brings all fallen party members back to life.\nRepel Phys in Teal pairs well with Alilat or Atavaka as an Anti-Pierce unit.\nHas 2 strong AOE spells, 3 if in Red.",
    "Cons": "High MP costs\nDark weakness\nLow Magic stat wastes his AOE potential, despite having good spells and panels."
  },
  {
    "Name": "Quetzalcoatl A",
    "BestArchetypePvE": "P",
    "BestArchetypePvP": "RP",
    "PvEScore": 8,
    "PvPOffenseScore": 9,
    "PvPDefScore": 8,
    "Pros": "Has full Fire Pierce and Fire Amp by default, plus Butcher in Purple. This makes him a deadly Fire Sweeper for both Fire Democalypse and PVP.\nAztec Pulse costs only 5 MP when maxed and does massive damage when combined with his other passives. The low MP cost also means you can spam it twice with Divine Brands going first, or twice with Spell Brands going second.\nCe Acatl grants him a free revive once per battle, while refunding the press turn lost from his death. This makes him a great counter for Fast T1 Teams on offense, as anything short of a full team wipe will result in him coming back to life and reverse-sweeping with double Aztec Pulses.\nPairs well with Rama has he has Drain Fire by default. This is especially useful versus Herald team comps to counter Uriel's Sunrise.\nRed gives him access to discounted Trisagion, useful versus Fire Anti-Pierce.",
    "Cons": "As press turn count is determined at the start of the round, Ce Acatl press turn generation only cancels out the lost press turn from his death.\nWeak to Dark. Dark is a very bad weakness to have, as Alice and Hecate are very common among higher tier PVP.\nPurple has troubles versus Fire Anti-Pierce comps like Atavaka-Vairocana and Rama-Surt."
  },
  {
    "Name": "Rama",
    "BestArchetypePvE": "",
    "BestArchetypePvP": "TYP",
    "PvEScore": 8,
    "PvPOffenseScore": 9,
    "PvPDefScore": 9,
    "Pros": "While alive, Drain Pierce will prevent pierce skills from going through Drain resistances. This is very useful when combined with demons that have high innate Drain (like Shiva) or against popular attack elements like Physical.\nDrain Pierce allows him to be the center of Drain Teams a Meta-relevant PVP Team.\nBrahmastra is a three-hit Almighty skill that functions as an Endure-breaker.\nGood base stats and no weaknesses allow him to fulfill a variety of roles, be it support or sweeper.\nYellow Rama can function as a good support demon with discounted Luster Candy. Teal gives him Drain Ice which pairs well with Drain Pierce whereas Purple gives him Ice Pierce which lets him act as a sweeper with innate Mabufudyne.\nLike Alilat, his Anti-Pierce passive is perfect for cheesing Boss fights, especially Aura Gate 2.",
    "Cons": "High MP cost skills\nNot very bulky"
  },
  {
    "Name": "Raphael",
    "BestArchetypePvE": "TP",
    "BestArchetypePvP": "P",
    "PvEScore": 7,
    "PvPOffenseScore": 7,
    "PvPDefScore": 7,
    "Pros": "Tailwind does massive damage against single targets, ideal for Bosses or cleaning up in PVP.\nInnate Pierce with decent Magic + Revive makes for a good unique Skill.\nGood for PVE content like Brands of Sin Sloth, the general story and Aura Gate.\nOne of the best demons to include in the Archangels strategy, a very strong strategy.",
    "Cons": "His chain attack does not deal damage, unlike Uriel and Gabriel.\nNeeds team built around him.\nNon-fusable and not obtainable through the general gem banner or the summon files."
  },
  {
    "Name": "Red Rider",
    "BestArchetypePvE": "TP",
    "BestArchetypePvP": "P",
    "PvEScore": 6,
    "PvPOffenseScore": 5,
    "PvPDefScore": 5,
    "Pros": "Good Str, decent Agi and Luck means he will hit hard without much Accuracy issues.\nBlade of Terror deals consistent Fractional damage based on enemies current HP, unaffected by buffs. Blade of Terror will bypass the accuracy check since it is a fractional skill.",
    "Cons": "Blade of Terror falls off later in the fight as it is based on Current HP.\nBuffs and damage boosts only work on Bloodshed's Physical damage and not Blade of Terror's Fractional damage.\nBlade of Terror doesn't do much damage as 25% is rather low for PVP and the max damage is capped against late game targets in PVE.\nNot obtainable through the general gem banner or the summon files."
  },
  {
    "Name": "Samael",
    "BestArchetypePvE": "P",
    "BestArchetypePvP": "P",
    "PvEScore": 6,
    "PvPOffenseScore": 7,
    "PvPDefScore": 7,
    "Pros": "God's Malice is very good to lock down a single target with multiple Ailments.\nInfinite Chakra helps to reduce MP requirements, allowing him to spam God's Malice.\nP3 is insanely powerful, providing free Barrier Break and Makara Break at the start of turn without consuming Press Turns.\nGreat set of Panels that provide additional Ailment Infliction, reduce MP costs and the aforementioned breaks. Easy 4x4 fusion paths make him a good P3 goal to strive toward.\nMana Aid is a great transfer skill.",
    "Cons": "Elec weakness\nCountered very hard by Daisoujou clearing his ailments and punishing him for using Charm.\nMiddling AGI hurts battle speed for fast Ailment teams."
  },
  {
    "Name": "Seraph",
    "BestArchetypePvE": "C",
    "BestArchetypePvP": "C",
    "PvEScore": 6,
    "PvPOffenseScore": 2,
    "PvPDefScore": 2,
    "Pros": "Very high Magic stat, combined with Garden of Eden and Merciless Blow lets him hit weaknesses hard.\nInnate Trisagion and Thunderclap deal massive damage when targeting weakness.\nGarden of Eden provides a teamwide boost to damage on hitting weakness, making him perfect for Democalypse.\nPanels give him and his teammates even more damage.",
    "Cons": "Only obtainable through Democalypse grinding.\nHigh MP costs make him unsuitable for anything outside Democalypse."
  },
  {
    "Name": "Seth",
    "BestArchetypePvE": "CT",
    "BestArchetypePvP": "CT",
    "PvEScore": 7,
    "PvPOffenseScore": 4.5,
    "PvPDefScore": 4.5,
    "Pros": "Ouas is a very powerful ST nuke that has a high crit rate and a strong heal.\nExtremely high STR and LUK means he will hit hard and crit often.\nTeal covers his weakness while Clear gives him an AOE skill in Titanomachia.\nYellow gives him Nocturne which allows him to play a more support-oriented role, especially with innate Debilitate.\nGood set of panels that provide him damage, bulk and MP reduction.",
    "Cons": "Lacks Phys Pierce, reducing his viability in certain areas which require it.\nFire weakness\nZandyne is a wasted slot.\nRequires damage boost transfers"
  },
  {
    "Name": "Shiva A",
    "BestArchetypePvE": "TP",
    "BestArchetypePvP": "TP",
    "PvEScore": 9,
    "PvPOffenseScore": 9.5,
    "PvPDefScore": 9.5,
    "Pros": "Third Eye is fully unblockable and will go through any elemental NDRs and barriers like Five Elements. It is also treated as a physical attack and as such can Crit (synergies well with Ishvara).\nIshvara provides auto-Rebellion and passively boosts his accuracy and crit chance.\nCan be paired with Parvati for a devastating first-turn kill team in PVP.\nInsane set of panels that give him everything he needs (accuracy, better ST and reduced MP cost).",
    "Cons": "Third Eye can miss.\nForce weakness if not Teal."
  },
  {
    "Name": "Shiva",
    "BestArchetypePvE": "TRP",
    "BestArchetypePvP": "TR",
    "PvEScore": 8,
    "PvPOffenseScore": 6,
    "PvPDefScore": 6,
    "Pros": "High STR, AGI and LUK paired with innate Serial Killer and Vorpal Blade make him an effective Physical Sweeper.\nHighest Combines Stats in the game.\nPralaya is an Almighty spell that is based on PATK, giving him an alternative when faced with Phys NDR.\nGood candidate for the Hell Gongen team as it provides him much needed Phys Pierce.\nGreat set of Panels that give him increased damage, accuracy, Crit and reduced MP costs.\nHas three sets of Drain resistances and no weakness if in Teal, making him an ideal teammate for Rama.",
    "Cons": "Pralaya is blocked by Five Elements and is low Damage.\nNeeds a lot of investment to bring out his true potential.\nWithout Panel 3, his PVP tier rating is lower than 7.\nVery expensive to fuse."
  },
  {
    "Name": "Siegfried",
    "BestArchetypePvE": "YRP",
    "BestArchetypePvP": "R",
    "PvEScore": 8,
    "PvPOffenseScore": 8,
    "PvPDefScore": 8,
    "Pros": "Arms Mastery provides him free Phys Amp and +25% Accuracy when maxed.\nDrain Phys and no weaknesses makes him an ideal demon to pair with Rama in Drain Teams.\nPanels give him much needed Phys Pierce and reduces the damage from piercing Phys attacks.",
    "Cons": "Heavily reliant on panels; without P2, his Offense PVP rating is much lower than 8.\nNo AOE outside of Red.\nMediocre AGI and LUK stats."
  },
  {
    "Name": "Surt",
    "BestArchetypePvE": "CP",
    "BestArchetypePvP": "C",
    "PvEScore": 6,
    "PvPOffenseScore": 7,
    "PvPDefScore": 7,
    "Pros": "Great demon for slow teams, as he provides Intimidating Stance and Tetra Shift.\nRagnarok hits like a truck and has an MP refund when maxed.\nPurple provides Fire Pierce if preferred for PVE.",
    "Cons": "Ice weakness\nAI is very bad on Defense without Divine Brands, as he will only Ragnarok once and default to spamming Berserker God.\nLow Magic stat\nNo innate Fire Pierce if Clear"
  },
  {
    "Name": "Susano-o A",
    "BestArchetypePvE": "TRP",
    "BestArchetypePvP": "TP",
    "PvEScore": 9,
    "PvPOffenseScore": 8,
    "PvPDefScore": 9,
    "Pros": "Is a Phys powerhouse with proper brands and can be used to focus down enemies quickly with Violent Slash.\nHeavenly Valor punishes enemies who pass when used in PVP Defense teams.\nNulls Phys and Drains Force innately. Gains Drain Phys in Teal which goes well with Rama as Anti-Pierce.",
    "Cons": "No added Accuracy in his kit. Requires extra Accuracy investment from Brands or skill transfer to hit reliably.\nFire Weakness.\nOnly excels with great brands, since he needs offensive stats and bulk. Only decent with sub-par brands.\nHeavenly Valor can be countered, and misses will trigger passives like Andalucia and Brilliant Wings."
  },
  {
    "Name": "Susano-o",
    "BestArchetypePvE": "P",
    "BestArchetypePvP": "CP",
    "PvEScore": 8,
    "PvPOffenseScore": 6,
    "PvPDefScore": 6,
    "Pros": "Very powerful Force nuker. Kusanagi hits extremely hard and autocasts Tarukaja to further buff your team's attack.\nEasy 4x4 fusion paths and good panels make him a decent P3 goal to strive toward.\nSince Kusanagi scales from Phys Attack, Mortal Jihad is also a viable method of attack.\nHis ability to effectively attack in two elements (Phys and Force) allows him to work around his lack of pierce in most situations.",
    "Cons": "Middling Accuracy means that Mortal Jihad will be prone to missing in higher tiers of PvP where evade builds are more common.\nNo innate pierce.\nFire Weakness"
  },
  {
    "Name": "Thor",
    "BestArchetypePvE": "P",
    "BestArchetypePvP": "P",
    "PvEScore": 7,
    "PvPOffenseScore": 4.5,
    "PvPDefScore": 4.5,
    "Pros": "Mjolnir deals massive damage against single targets, ideal for Bosses and Democalypse.\nHas Elec Pierce in Purple.\nPanels give him a lot of damage, especially P3.",
    "Cons": "AI is extremely bad on Auto, as Charge will mess him up.\nForce Weakness\nNo innate AOE or ST Elec spells. Random targetting is very hard to use for PVP.\nHe may need another Elec spell transfered which will a precious slot.\nBad AGI and LUK stats also make a Physical build unviable, resulting in Charge and Megaton Raid wasting slots for the Elec Mage build.\nRequires damage boost transfers and/or Panels to really shine.\nLow Magic stat"
  },
  {
    "Name": "Tokisada",
    "BestArchetypePvE": "RP",
    "BestArchetypePvP": "P",
    "PvEScore": 7,
    "PvPOffenseScore": 7,
    "PvPDefScore": 7,
    "Pros": "Flag of Salvation boosts your entire team's light damage, making him useful for Brands of Sin: Sloth 11 and Light Democalypse. It also passively restores 1 MP to your whole party when clearing a wave. This additional MP allows your other demons to drop Divine Brands and/or Mana Aid in favor for more offensive brands and passives.\nAmakusa Uprising deals heavy single target damage and can crit. Combined with innate Death Blow and Light Amp in purple, this makes him a very strong Light nuker, especially with P2 unlocked. It also provides your team Tarukaja and Sukukaja buffs, allowing your following demons to hit harder.\nRed gives him access to discounted Mahamadyne. Note that having this unlocked might mess up your Brands of Sin: Sloth 11 runs, as the AI will prioritize it over Amakusa Uprising.\nGreat set of Gacha and Transfer skills, currently the only source of Death Blow and Auto-Rebellion.\nPossibly one of the coolest models in the whole game. The floating ghosts actually orbit him while idle!",
    "Cons": "Requires Panel 2 to unlock his full potential for PVP, as being able to guarantee crits for extra turns is very powerful.\nWithout Panel 2 and/or Auto-Rebellion transfered, he would get a PVP rating around 6 or less.\nOnly has pierce through Amakusa Uprising, no Piercing AOE.\nNeeds accuracy investment for PVP, as Amakusa Uprising can miss."
  },
  {
    "Name": "Trumpeter",
    "BestArchetypePvE": "",
    "BestArchetypePvP": "YRP",
    "PvEScore": 7,
    "PvPOffenseScore": 6.5,
    "PvPDefScore": 6.5,
    "Pros": "Apocalypse deals strong Almighty AOE damage while having a high mute chance for a low MP cost.\nAccess to Concentrate to further increase his damage.\nNo weaknesses and 2 Nulls give him a lot of flexibility in skill transfers.",
    "Cons": "Mute from Apocalypse is blocked by Barrier, requires a teammate with Barrier Break or P2 to effectively work.\nApocalypse does not get higher damage from leveling up the skill or from Panels, and as an Almighty skill can only be boosted by passives such as Butcher, Serial Killer...\nHard countered by Five Elements.\nStiff competition from other Almighty sweepers like Mother Harlot."
  },
  {
    "Name": "Uriel",
    "BestArchetypePvE": "TP",
    "BestArchetypePvP": "P",
    "PvEScore": 8,
    "PvPOffenseScore": 8,
    "PvPDefScore": 8,
    "Pros": "When combined with two other Herald or Divine demons, God's Fire dishes out massive damage even before battle really begins. It also gives your party a Tarukaja attack buff, further increasing damage from their chain attacks.\nChain effects do not consume press turns even when hitting NDR.\nInnate Pierce with decent Magic + Revive makes for a good unique Skill.\nPart of a very strong PVP strategy: Archangels\nGood for PVE content like Brands of Sin Sloth, the general story and Aura Gate (note that his passive will kill demons before they have a chance to talk)",
    "Cons": "Needs Team built around him.\nCountered severely by P2 Asherah, a very common demon.\nNon-fusable and not obtainable through the general gem banner or the summon files."
  },
  {
    "Name": "Vairocana",
    "BestArchetypePvE": "TP",
    "BestArchetypePvP": "TP",
    "PvEScore": 7,
    "PvPOffenseScore": 7,
    "PvPDefScore": 7.5,
    "Pros": "Good repel resistances makes him a natural partner for Alilat and Atavaka. Fire and Light repel is especially useful to counter Archangel teams, as it makes him immune to both their AOE elements.\nHigh MAG and Butcher in purple allows him to function as a strong almighty sweeper.\nRadiant Mantra resets all buffs and debuffs at the start of enemy turn. When used in a slow team, this allows him to nullify auto-skills, giving your team more flexibility in skill transfer.\nIn addition to dealing respectable almighty damage, Path of Prominence also applies a mini Luster Candy buff, extending his role as a buff control specialist.\nNo weaknesses and a self-sufficient kit gives him full flexibility over skill transfers.",
    "Cons": "Very hard to further boost his damage.\nDespite wanting to go second to fully abuse Radiant Mantra, his AGI is on the high side.\nRequires good teammates to shine.\nVery high MP costs. Even with maxed Path of Prominence and Divine Brands, he won't be able to spam it consistently unless Panel 2 is also unlocked.\nFull Almighty / non-Piercing kit means he is shut down hard by Five Elements."
  },
  {
    "Name": "Vasuki",
    "BestArchetypePvE": "RP",
    "BestArchetypePvP": "CR",
    "PvEScore": 5,
    "PvPOffenseScore": 4,
    "PvPDefScore": 4,
    "Pros": "Has Innate Insanity and Ice Boost for both Ailment infliction and damage.\nInnate Butcher in Purple.\nHalahala deals massive damage against single targets, ideal for Bosses and Democalypse.\nP3 autocasts Rakunda, which is invaluable in Democalypse boss phases where buffs are hard to come by.\nDecent AGI, suitable for a T1 mage team.",
    "Cons": "Ailments generally fall flat in late/endgame PvE because of inflated enemy stats\nPoison (and by extension Insanity) does literally nothing for his Ice builds.\nLacks of pierce and being limited to only random targetting makes him very bad for PVP."
  },
  {
    "Name": "Vishnu",
    "BestArchetypePvE": "CR",
    "BestArchetypePvP": "R",
    "PvEScore": 6,
    "PvPOffenseScore": 6,
    "PvPDefScore": 6,
    "Pros": "Very high magic and good bulk make him a tanky Mage, especially when combined with Avatar.\nGains discounted Megidolaon in Red.\nGood panels that give him free healing and MP reduction.",
    "Cons": "Low AGI\nFire weakness\nNeeds heavy investment from Brands and Panels to become really effective\nFull Almighty / non-Piercing kit means he is shut down hard by Five Elements.\nPanel 2's auto-healing is a disaster against Black Rider, since it cannot be turned off."
  },
  {
    "Name": "V☆",
    "BestArchetypePvE": "",
    "BestArchetypePvP": "YR",
    "PvEScore": 7,
    "PvPOffenseScore": 8,
    "PvPDefScore": 8.5,
    "Pros": "Griffon-Bolt is borderline oppressive when combined with Turn 1 teams with lots of Crit passing for Press Turn generation. Good teammates include Masakado A, Asura Lord and Kartikeya.\nWill virtually never have MP issues thanks to Shadow-Shock giving him a free Almighty ST attack.\nBalanced stats and no weaknesses give him flexibility in transfer skills.\nRed and Yellow give him an Almighty AOE skills that debuffs.\nLaughs at his enemies occasionally",
    "Cons": "Very harshly countered by Five Elements on Defense, as the AI does not know how to pass and will lose press turns attacking into it.\nRelies on auto-attacks, does not contribute much if his teammates are spamming skills instead.\nDemons with AOE reduction passives like Hecatoncheires and Orcus significantly reduces his damage.\nLimited-time Collaboration unit, unlikely to return in the future."
  },
  {
    "Name": "Yama",
    "BestArchetypePvE": "RP",
    "BestArchetypePvP": "P",
    "PvEScore": 9,
    "PvPOffenseScore": 5,
    "PvPDefScore": 8,
    "Pros": "Very powerful Dark Mage. Guilty passively increases his dark damage while dealing bonus damage at the start of a boss wave.\nOnly true Dark Pierce demon in Purple.\nEnma's Judgement provides team-wide Null Mortal and Rakukaja, which can be very powerful in PVP depending on tier.\nTrivializes Brands of Sin Vanity 11, works well for Aura Gate.",
    "Cons": "Guilty only works on Boss wave, rendering it useless for PVP and most of PVE.\nNo AOE spell unless Red (which then loses Dark Pierce)."
  },
  {
    "Name": "Yoshitsune",
    "BestArchetypePvE": "TP",
    "BestArchetypePvP": "TP",
    "PvEScore": 10,
    "PvPOffenseScore": 5,
    "PvPDefScore": 5,
    "Pros": "Carries a native Mana Aid giving him 10 MP per wave to repeatedly Vorpal Blade or Hassou Tobi.\nInnate Mana Aid, strong AoE and the best Multi-hit Phys Spell in the game, combined with Phys Amp in Purple makes him the best Phys Attacker for PvE, usable pretty much anywhere.\nFully upgraded Hassou Tobi sports a massive amount of phys damage on single targets.\nTeal can be used to cheese certain PvE Content.",
    "Cons": "Only native pierce on Hassou Tobi.\nRandom Targetting on Hassou Tobi makes it bad against Waves and in PvP"
  },
  {
    "Name": "Zaou-Gongen",
    "BestArchetypePvE": "R",
    "BestArchetypePvP": "R",
    "PvEScore": 9,
    "PvPOffenseScore": 6,
    "PvPDefScore": 6,
    "Pros": "Has the incredibly useful ability Kongo Zaou.\nIs one of the core demons of Hell Gongen which is one of the best Team Comps in the game.\nRed gives him a cheap AOE attack in Herculean Strike.\nWith Panel 3 he can start a crit loop, providing infinite Crits for the whole team and negating the need for Hell Biker.\nWhile not common, he can work as a Fire Mage as he has passable Magic and Fire Amp in Purple.\nGreat set of Panels that provide additional damage, accuracy and team-wide Rebellion.",
    "Cons": "Middling AGI means his Accuracy and Speed will suffer.\nRequires good Crit% Brands to run without Hell Biker at Panel 3, especially Lead Brand sets as you ideally want him to go first to provide free Rebellion for the whole team."
  },
  {
    "Name": "Anzu",
    "BestArchetypePvE": "RP",
    "BestArchetypePvP": "YR",
    "PvEScore": 6,
    "PvPOffenseScore": 3,
    "PvPDefScore": 3,
    "Pros": "Decent AGI.\n5MP double debuff in Yellow. (also innately has another double debuff)\nExcellent demon for Elec Democalypse.",
    "Cons": "Ice weakness.\nLow VIT.\nUnderwhelming."
  },
  {
    "Name": "Attis",
    "BestArchetypePvE": "C",
    "BestArchetypePvP": "C",
    "PvEScore": 4,
    "PvPOffenseScore": 3.5,
    "PvPDefScore": 3.5,
    "Pros": "Innate Enduring Soul and Recarmdra which are good support skills that synergyze well.\nNo weakness.\nThe result is: he has 2 completely free transfer slot.\nOkayish innate bulk in P3.",
    "Cons": "Doesn't have many other uses.\nThe skills you will transfer to him determine what other supporting role he'll have in addition to reviver."
  },
  {
    "Name": "Azrael",
    "BestArchetypePvE": "CR",
    "BestArchetypePvP": "RP",
    "PvEScore": 3,
    "PvPOffenseScore": 2,
    "PvPDefScore": 2,
    "Pros": "-",
    "Cons": "-"
  },
  {
    "Name": "Chernobog",
    "BestArchetypePvE": "YP",
    "BestArchetypePvP": "YP",
    "PvEScore": 2,
    "PvPOffenseScore": 4,
    "PvPDefScore": 4,
    "Pros": "Ailment chain effect inflicting poison and bind if P3.\nPerfect synergy with Nergal.",
    "Cons": "Somewhat low AGI: this is bad for Ailment Team\nStrongly needs Nergal to have some viability in PVP.\n...but Nergal himself isn't the best demon for Ailment Team.\nNeeds P3 to be viable in PVP. He would be lower than 4 in PVP if P3 were not taken into account."
  },
  {
    "Name": "Gurr",
    "BestArchetypePvE": "RP",
    "BestArchetypePvP": "RP",
    "PvEScore": 5,
    "PvPOffenseScore": 6,
    "PvPDefScore": 6,
    "Pros": "Belongs to the class of demon you want at least one of in your team to go consistently first in PVE and PVP.\nFor PVE, he is not the best one from that class.\nBut he has innate Speedster.\nYaksha Claw a passive quick effect that can inflict Bind: ailment passive quick effects are extremely precious for Ailment Team.\nThis passive pairs perfectly with Pale Rider one of the strongest ailment demon of the game.",
    "Cons": "2 weaknesses\nPhys weakness is extremely disavantageous.\nYaksha Claw is random target instead of AOE.\nYaksha Claw cannot bind if it gets Nulled, Repeled or Drained.\nIt makes the use of Phys Pierce (weak) mandatory for a PVP build."
  },
  {
    "Name": "Jeanne d'Arc",
    "BestArchetypePvE": "TY",
    "BestArchetypePvP": "TY",
    "PvEScore": 6,
    "PvPOffenseScore": 4.5,
    "PvPDefScore": 2.5,
    "Pros": "One of the best healer.\nOrlean Prayer can be used to give 3 MP to a demon: in PVP, this can allow some demons to unleash spells they couldn't have T1.\nPanel 3 gives Orlean Prayer some buff ability. This is very useful for the shenanegan mentioned above.\nHas a good AGI. Perfect for this strategy.",
    "Cons": "Healing is not very powerful in this game.\nDespite how good Orlean Prayer in P3 is, PVP is too fast and each turn press are too precious for such strategy to be good.\nThe AI won't perform such T1 strategy."
  },
  {
    "Name": "Kikuri-Hime",
    "BestArchetypePvE": "TR",
    "BestArchetypePvP": "RP",
    "PvEScore": 3,
    "PvPOffenseScore": 2,
    "PvPDefScore": 2,
    "Pros": "Has Tetraka Shift in Purple.\nDecent MAG.",
    "Cons": "Bad AGI.\nLow VIT.\n2 weaknesses.\nDark weakness is particularly bad in PVP."
  },
  {
    "Name": "Sandalphon",
    "BestArchetypePvE": "YR",
    "BestArchetypePvP": "P",
    "PvEScore": 6,
    "PvPOffenseScore": 3.5,
    "PvPDefScore": 3.5,
    "Pros": "Decent bulk.\nSomewhat decent AGI.\nNo weakness.\nHas Auto-Sukuka which is an incredible support skill.\nHe is the cheapest way to get an auto-buff in your team.",
    "Cons": "No offensive ability.\nDoes not innately have other noteworthy support skills."
  },
  {
    "Name": "Skadi",
    "BestArchetypePvE": "RP",
    "BestArchetypePvP": "P",
    "PvEScore": 2,
    "PvPOffenseScore": 3.5,
    "PvPDefScore": 3.5,
    "Pros": "Has innately more than decent ailment kit (active skill, passive skill, panel and high Luck).\nOne of the best unit to use for Celestial Gui Xian fight.\nNeeds to be paired with Rama.",
    "Cons": "Too low AGI for an ailment team.\nOverally low stats."
  },
  {
    "Name": "Sleipnir",
    "BestArchetypePvE": "RP",
    "BestArchetypePvP": "RP",
    "PvEScore": 6,
    "PvPOffenseScore": 3,
    "PvPDefScore": 3,
    "Pros": "Has a very good set of innate non-unique skills.\nInnate Speedster.\nVery good light skils.\nDecent AGI.\nPanel 3 increases his speed.",
    "Cons": "Has no unique skill.\nFire weakness.\nNo pierce."
  },
  {
    "Name": "Sphinx",
    "BestArchetypePvE": "TR",
    "BestArchetypePvP": "TP",
    "PvEScore": 6,
    "PvPOffenseScore": 3,
    "PvPDefScore": 3,
    "Pros": "High MAG.\nMahamaon is a decent spell.\nTriggers passives that are strong when going second:\nTetraka Shift has some (limited) use in PVP and early PVE.\nin Purple, he has Auto-Rakuka and excellent skill for slow and defensive team.",
    "Cons": "Subpar bulk.\n2 weaknesses.\nNo unique support skill to complement his role in a PVP team."
  }
]